Revit 2027 API
IPointCloudAccess.GetUnitsToFeetConversionFactor Method
 Implement this method to return the conversion factor from the units of the point cloud to feet.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
double GetUnitsToFeetConversionFactor()
Function GetUnitsToFeetConversionFactor As Double
double GetUnitsToFeetConversionFactor()
abstract GetUnitsToFeetConversionFactor : unit -> float
Return Value
Double
 The multiplication factor to convert coordinates of points in this cloud to feet.
See Also
Reference
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace